In [56]:
import pandas as pd
import numpy as np
import io
pd.set_option('display.max_columns', None)

In [6]:
df_clientes = pd.read_csv("files/clientes.csv", index_col=0)

df_clientes.head(2)

,first_name,last_name,email,gender,City,Country,Address
id,,,,,,,
1,Cheri,Dunsmore,cdunsmore0@instagram.com,Female,Palma De Mallorca,Spain,076 Rockefeller Crossing
2,Hunt,Bartomeu,hbartomeu1@nsw.gov.au,Male,Lugo,Spain,0046 Utah Junction

In [26]:
df_productos = pd.read_csv("files/productos.csv", index_col=0)

df_productos.head(2)

,Nombre_Producto,Categoría,Precio,Origen,Descripción,Descripción_2,Descripción_3,Descripción_4,Descripción_5
ID,,,,,,,,,
A1,Pizza Margherita,Platos Preparados,8.99,Italia,Clásica pizza italiana con tomate,mozzarella fresca y albahaca.,NaN,NaN,NaN
B2,Risotto de Champiñones,Platos Preparados,6.75,Italia,Risotto cremoso con champiñones frescos,una delicia italiana para disfrutar en casa.,NaN,NaN,NaN

In [37]:
df_productos["Descripción"] = df_productos[['Descripción',' Descripción_2', ' Descripción_3', ' Descripción_4', ' Descripción_5']].apply(list, axis=1)

In [ ]:
df_productos.drop([' Descripción_2', ' Descripción_3', ' Descripción_4', ' Descripción_5'], axis=1, inplace=True) #Esto mete en la lista también los nan, habrçia que mirarlo

In [10]:
df_ventas = pd.read_csv("files/ventas.csv", index_col=0)

df_ventas.head(2)

           ID_Producto Fecha_Venta  Cantidad  Total
ID_Cliente
723                 A1  2023-11-22         2  17.98
498                 C3  2023-11-21         1   5.49

# Exploración

In [52]:
df_clientes.shape

(1000, 7)

In [53]:
df_productos.shape

(33, 5)

In [54]:
df_ventas.columns.shape

(4,)

- Las ventas tienen el ID_producto que es el index de productos. El index de clientes es el mismo que el de ventas (ID_Cliente)

- Hay 1000 clientes, 4 ventas y 33 productos

# Limpieza

In [57]:
df_clientes.head(5)

,first_name,last_name,email,gender,City,Country,Address
id,,,,,,,
1,Cheri,Dunsmore,cdunsmore0@instagram.com,Female,Palma De Mallorca,Spain,076 Rockefeller Crossing
2,Hunt,Bartomeu,hbartomeu1@nsw.gov.au,Male,Lugo,Spain,0046 Utah Junction
3,Michaeline,Paynton,mpaynton2@narod.ru,Female,NaN,Spain,0 Corry Crossing
4,Filmer,Eirwin,feirwin3@intel.com,NaN,Leon,Spain,5 American Ash Road
5,Tanhya,Lubbock,tlubbock4@huffingtonpost.com,Female,"Hospitalet De Llobregat, L'",Spain,9289 Merry Circle

In [75]:
df_clientes.columns = df_clientes.columns.str.lower()

In [60]:
for col in df_clientes.columns:
    print(f"La columna {col} tiene {df_clientes[col].isna().sum()} nulos")

La columna first_name tiene 0 nulos
La columna last_name tiene 0 nulos
La columna email tiene 27 nulos
La columna gender tiene 77 nulos
La columna City tiene 124 nulos
La columna Country tiene 154 nulos
La columna Address tiene 41 nulos

In [64]:
df_clientes["email"] = df_clientes["email"].fillna("Unknown")

In [65]:
df_clientes["email"].isna().sum()

0

In [70]:
df_clientes["gender"] = df_clientes["gender"].fillna("Other / Prefer not to say")

In [71]:
df_clientes["gender"].isna().sum()

0

In [82]:
df_clientes["country"] = df_clientes["country"].fillna("Spain")

In [83]:
df_clientes["city"] = df_clientes["city"].fillna("Unknown")

In [85]:
df_clientes["address"] = df_clientes["address"].fillna("Unknown")

In [86]:
for col in df_clientes.columns:
    print(f"La columna {col} tiene {df_clientes[col].isna().sum()} nulos")

La columna first_name tiene 0 nulos
La columna last_name tiene 0 nulos
La columna email tiene 0 nulos
La columna gender tiene 0 nulos
La columna city tiene 0 nulos
La columna country tiene 0 nulos
La columna address tiene 0 nulos

In [89]:
for col in df_clientes.columns:
    print(f"La columna {col} tiene {df_clientes[col].duplicated().sum()} duplicados")

La columna first_name tiene 60 duplicados
La columna last_name tiene 14 duplicados
La columna email tiene 26 duplicados
La columna gender tiene 991 duplicados
La columna city tiene 944 duplicados
La columna country tiene 999 duplicados
La columna address tiene 41 duplicados

In [ ]:
df_clientes["email"]

False

In [94]:
df_clientes[df_clientes.duplicated(subset="email", keep=False)].sort_values("email")

,first_name,last_name,email,gender,city,country,address
id,,,,,,,
8,Aubree,Jirsa,Unknown,Female,Santander,Spain,8294 Schurz Court
846,Nicolle,Erridge,Unknown,Female,Pontevedra,Spain,7336 Upham Circle
779,Rozanne,Rolinson,Unknown,Female,Cadiz,Spain,8239 Porter Junction
733,Lazare,Anderton,Unknown,Other / Prefer not to say,Girona,Spain,16 Grover Point
666,Micki,Van Der Hoog,Unknown,Female,Barcelona,Spain,4 Hayes Hill
602,Renaud,Aberkirdo,Unknown,Male,Unknown,Spain,112 Gerald Lane
601,Cecilia,Lush,Unknown,Female,Malaga,Spain,03819 Mallard Avenue
593,Noreen,Crann,Unknown,Female,Leon,Spain,875 Lake View Point
578,Malinda,Baldazzi,Unknown,Agender,Torrevieja,Spain,4079 Westend Parkway
539,Margalo,Steketee,Unknown,Female,Zamora,Spain,7 Warbler Street
479,Lana,Kirkbright,Unknown,Female,Pontevedra,Spain,3 Lawn Court
455,Mateo,Davidovits,Unknown,Male,Santiago De Compostela,Spain,17906 Miller Court
879,Gabrielle,Iwanczyk,Unknown,Female,Valencia,Spain,01 Onsgard Way
446,Gerri,Widdowfield,Unknown,Male,Lleida,Spain,61207 Granby Drive
418,Urban,Mapstone,Unknown,Male,Unknown,Spain,1 Sullivan Circle
408,Brittne,Weich,Unknown,Genderfluid,Pontevedra,Spain,763 Mayer Lane
232,Ethelred,Aireton,Unknown,Male,Unknown,Spain,6166 Starling Way
216,Alva,Gauchier,Unknown,Male,Badajoz,Spain,7 Cherokee Center
214,Hallsy,Deeney,Unknown,Male,Barcelona,Spain,8684 Crescent Oaks Trail
212,Darsey,Scargle,Unknown,Female,"Coruña, A",Spain,04988 Roxbury Court
172,Madonna,McClymond,Unknown,Female,"Palmas De Gran Canaria, Las",Spain,70142 Prairieview Point
168,Storm,Musterd,Unknown,Female,Badajoz,Spain,Unknown
82,Uta,Crasford,Unknown,Female,Lugo,Spain,Unknown
43,Salmon,Ricciardello,Unknown,Male,Donostia-San Sebastian,Spain,5237 Montana Drive
17,Yance,Martinetto,Unknown,Male,Pamplona/Iruña,Spain,4 Anthes Pass
440,Kalila,Goldspink,Unknown,Female,Sevilla,Spain,973 Loomis Avenue
989,Jermain,Klassmann,Unknown,Other / Prefer not to say,Palma De Mallorca,Spain,8083 Burning Wood Pass